/* automatically generated by rust-bindgen 0.69.4 */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]

extern "C" {
    #[doc = "! @{\n*! \\brief Encoder for LDPC in 5GNR.\n\\param [in] request Structure containing configuration information and input data.\n\\param [out] response Structure containing kernel outputs.\n\\note bblib_ldpc_decoder_5gnr provides the most appropriate version for the available ISA,\nthe _avx512 etc. version allow direct access to specific ISA implementations.\n\\return Success: return 0, else: return -1.\n*/"]
    pub fn bblib_ldpc_decoder_5gnr(
        request: *mut bblib_ldpc_decoder_5gnr_request,
        response: *mut bblib_ldpc_decoder_5gnr_response,
    ) -> i32;
}

#[doc = "\\struct bblib_ldpc_decoder_5gnr_request\n\\brief Structure for input parameters in API of LDPC Decoder for 5GNR.\n\\note ... \\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bblib_ldpc_decoder_5gnr_request {
    #[doc = "< Lifting factor Zc as defined in TS38212-5.2.1."]
    pub Zc: u16,
    #[doc = "< LDPC Base graph, which can be 1 or 2 as defined in TS38212-5.2.1."]
    pub baseGraph: i32,
    #[doc = "< Number Rows in the LDPC being used for the encoding native code rate - Minimum 4"]
    pub nRows: i32,
    pub varNodes: *mut i8,
    #[doc = "<The number of post rate-matched output LLR values"]
    pub numChannelLlrs: i16,
    #[doc = "< The number of filler bits used in the encoding"]
    pub numFillerBits: i16,
    pub maxIterations: i16,
    pub enableEarlyTermination: bool,
}
#[test]
fn bindgen_test_layout_bblib_ldpc_decoder_5gnr_request() {
    const UNINIT: ::std::mem::MaybeUninit<bblib_ldpc_decoder_5gnr_request> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bblib_ldpc_decoder_5gnr_request>(),
        32usize,
        concat!("Size of: ", stringify!(bblib_ldpc_decoder_5gnr_request))
    );
    assert_eq!(
        ::std::mem::align_of::<bblib_ldpc_decoder_5gnr_request>(),
        8usize,
        concat!("Alignment of ", stringify!(bblib_ldpc_decoder_5gnr_request))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Zc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_request),
            "::",
            stringify!(Zc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseGraph) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_request),
            "::",
            stringify!(baseGraph)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nRows) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_request),
            "::",
            stringify!(nRows)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).varNodes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_request),
            "::",
            stringify!(varNodes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numChannelLlrs) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_request),
            "::",
            stringify!(numChannelLlrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numFillerBits) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_request),
            "::",
            stringify!(numFillerBits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxIterations) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_request),
            "::",
            stringify!(maxIterations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enableEarlyTermination) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_request),
            "::",
            stringify!(enableEarlyTermination)
        )
    );
}
#[doc = "\\struct bblib_ldpc_decoder_5gnr_response\n\\brief structure for outputs of LDPC decoder for 5GNR.\n\\note"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bblib_ldpc_decoder_5gnr_response {
    pub varNodes: *mut i16,
    #[doc = "<\nOutput message stored as individual bits in a pre-allocated buffer.\nNumber of bytes allocation *must* be  >= ceil((z*22 - numFillerBits)/8) for BG1\nNumber of bytes allocation *must* be  >= ceil((z*10 - numFillerBits)/8) for BG2"]
    pub numMsgBits: ::std::os::raw::c_int,
    #[doc = "< Decoded Message Data"]
    pub compactedMessageBytes: *mut u8,
    #[doc = "< The number of iterations executed before termination."]
    pub iterationAtTermination: ::std::os::raw::c_int,
    #[doc = "<\nTrue if the parity checks all had passed at termination  (Always true if\nresponse.iterationAtTermination  < request.maxIterations)."]
    pub parityPassedAtTermination: bool,
}
#[test]
fn bindgen_test_layout_bblib_ldpc_decoder_5gnr_response() {
    const UNINIT: ::std::mem::MaybeUninit<bblib_ldpc_decoder_5gnr_response> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bblib_ldpc_decoder_5gnr_response>(),
        32usize,
        concat!("Size of: ", stringify!(bblib_ldpc_decoder_5gnr_response))
    );
    assert_eq!(
        ::std::mem::align_of::<bblib_ldpc_decoder_5gnr_response>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(bblib_ldpc_decoder_5gnr_response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).varNodes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_response),
            "::",
            stringify!(varNodes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numMsgBits) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_response),
            "::",
            stringify!(numMsgBits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compactedMessageBytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_response),
            "::",
            stringify!(compactedMessageBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iterationAtTermination) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_response),
            "::",
            stringify!(iterationAtTermination)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parityPassedAtTermination) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(bblib_ldpc_decoder_5gnr_response),
            "::",
            stringify!(parityPassedAtTermination)
        )
    );
}

#[cfg(test)]
mod tests {
    use super::*;
    use std::ptr;

    #[test]
    fn test_bblib_ldpc_decoder_5gnr_basic_call() {
        // Test basic function call with minimal valid parameters
        let zc = 32u16; // Common lifting factor
        let base_graph = 1i32; // Base graph 1
        let n_rows = 4i32; // Minimum rows
        let num_channel_llrs = 100i16;
        let num_filler_bits = 0i16;
        let max_iterations = 10i16;

        // Allocate input data
        let mut var_nodes_input = vec![0i8; zc as usize * 22]; // BG1: z*22
        let mut var_nodes_output = vec![0i16; zc as usize * 22];
        let mut message_bytes = vec![0u8; ((zc as usize * 22) + 7) / 8]; // Ceiling division

        let mut request = bblib_ldpc_decoder_5gnr_request {
            Zc: zc,
            baseGraph: base_graph,
            nRows: n_rows,
            varNodes: var_nodes_input.as_mut_ptr(),
            numChannelLlrs: num_channel_llrs,
            numFillerBits: num_filler_bits,
            maxIterations: max_iterations,
            enableEarlyTermination: true,
        };

        let mut response = bblib_ldpc_decoder_5gnr_response {
            varNodes: var_nodes_output.as_mut_ptr(),
            numMsgBits: 0,
            compactedMessageBytes: message_bytes.as_mut_ptr(),
            iterationAtTermination: 0,
            parityPassedAtTermination: false,
        };

        // Call the function
        let result = unsafe { bblib_ldpc_decoder_5gnr(&mut request, &mut response) };

        // Function should return either 0 (success) or -1 (failure)
        // We're mainly testing that it doesn't crash
        assert!(
            result == 0 || result == -1,
            "Function should return 0 or -1, got {}",
            result
        );
    }

    #[test]
    fn test_bblib_ldpc_decoder_5gnr_base_graph_2() {
        // Test with base graph 2
        let zc = 64u16;
        let base_graph = 2i32; // Base graph 2
        let n_rows = 4i32;
        let num_channel_llrs = 80i16;
        let num_filler_bits = 0i16;
        let max_iterations = 8i16;

        // Allocate input data (BG2: z*10)
        let mut var_nodes_input = vec![0i8; zc as usize * 10];
        let mut var_nodes_output = vec![0i16; zc as usize * 10];
        let mut message_bytes = vec![0u8; ((zc as usize * 10) + 7) / 8];

        let mut request = bblib_ldpc_decoder_5gnr_request {
            Zc: zc,
            baseGraph: base_graph,
            nRows: n_rows,
            varNodes: var_nodes_input.as_mut_ptr(),
            numChannelLlrs: num_channel_llrs,
            numFillerBits: num_filler_bits,
            maxIterations: max_iterations,
            enableEarlyTermination: false,
        };

        let mut response = bblib_ldpc_decoder_5gnr_response {
            varNodes: var_nodes_output.as_mut_ptr(),
            numMsgBits: 0,
            compactedMessageBytes: message_bytes.as_mut_ptr(),
            iterationAtTermination: 0,
            parityPassedAtTermination: false,
        };

        let result = unsafe { bblib_ldpc_decoder_5gnr(&mut request, &mut response) };

        assert!(
            result == 0 || result == -1,
            "Function should return 0 or -1, got {}",
            result
        );
    }

    #[test]
    fn test_bblib_ldpc_decoder_5gnr_null_pointer_safety() {
        // Test function behavior with null pointers (should fail gracefully)
        let mut request = bblib_ldpc_decoder_5gnr_request {
            Zc: 32,
            baseGraph: 1,
            nRows: 4,
            varNodes: ptr::null_mut(),
            numChannelLlrs: 100,
            numFillerBits: 0,
            maxIterations: 10,
            enableEarlyTermination: true,
        };

        let mut response = bblib_ldpc_decoder_5gnr_response {
            varNodes: ptr::null_mut(),
            numMsgBits: 0,
            compactedMessageBytes: ptr::null_mut(),
            iterationAtTermination: 0,
            parityPassedAtTermination: false,
        };

        let result = unsafe { bblib_ldpc_decoder_5gnr(&mut request, &mut response) };

        // Should return -1 for invalid pointers
        assert_eq!(result, -1, "Function should return -1 for null pointers");
    }

    #[test]
    fn test_bblib_ldpc_decoder_5gnr_different_lifting_factors() {
        // Test with different valid lifting factors
        let lifting_factors = [2, 4, 8, 16, 32, 64, 128, 256];

        for &zc in &lifting_factors {
            let mut var_nodes_input = vec![0i8; zc * 22]; // BG1
            let mut var_nodes_output = vec![0i16; zc * 22];
            let mut message_bytes = vec![0u8; ((zc * 22) + 7) / 8];

            let mut request = bblib_ldpc_decoder_5gnr_request {
                Zc: zc as u16,
                baseGraph: 1,
                nRows: 4,
                varNodes: var_nodes_input.as_mut_ptr(),
                numChannelLlrs: 100,
                numFillerBits: 0,
                maxIterations: 5,
                enableEarlyTermination: true,
            };

            let mut response = bblib_ldpc_decoder_5gnr_response {
                varNodes: var_nodes_output.as_mut_ptr(),
                numMsgBits: 0,
                compactedMessageBytes: message_bytes.as_mut_ptr(),
                iterationAtTermination: 0,
                parityPassedAtTermination: false,
            };

            let result = unsafe { bblib_ldpc_decoder_5gnr(&mut request, &mut response) };

            // Test that function handles different lifting factors
            assert!(
                result == 0 || result == -1,
                "Function failed for lifting factor {}: returned {}",
                zc,
                result
            );
        }
    }

    #[test]
    fn test_bblib_ldpc_decoder_5gnr_response_fields() {
        // Test that response fields are properly set after function call
        let zc = 32u16;
        let mut var_nodes_input = vec![1i8; zc as usize * 22]; // Non-zero input
        let mut var_nodes_output = vec![0i16; zc as usize * 22];
        let mut message_bytes = vec![0u8; ((zc as usize * 22) + 7) / 8];

        let mut request = bblib_ldpc_decoder_5gnr_request {
            Zc: zc,
            baseGraph: 1,
            nRows: 4,
            varNodes: var_nodes_input.as_mut_ptr(),
            numChannelLlrs: 100,
            numFillerBits: 0,
            maxIterations: 10,
            enableEarlyTermination: true,
        };

        let mut response = bblib_ldpc_decoder_5gnr_response {
            varNodes: var_nodes_output.as_mut_ptr(),
            numMsgBits: 0,
            compactedMessageBytes: message_bytes.as_mut_ptr(),
            iterationAtTermination: 0,
            parityPassedAtTermination: false,
        };

        let result = unsafe { bblib_ldpc_decoder_5gnr(&mut request, &mut response) };

        if result == 0 {
            // If successful, check that response fields are reasonable
            assert!(
                response.iterationAtTermination >= 0,
                "Iteration count should be non-negative"
            );
            assert!(
                response.iterationAtTermination <= request.maxIterations as i32,
                "Iteration count should not exceed max iterations"
            );
        }
    }
}
